---
kind: method
id: M:Autodesk.Revit.DB.SymbolicCurveArray.GetEnumerator
source: html/04ec0c45-1b8c-8d51-0558-a0e934dabd34.htm
---
# Autodesk.Revit.DB.SymbolicCurveArray.GetEnumerator Method

Retrieve a forward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the array.